{
    "meta": {
        "size": 2411,
        "url": "https://www.elastic.co/guide/en/elasticsearch/reference/current/add-repository.html",
        "type": "documentation",
        "role": [],
        "has_code": false,
        "title": "add-repository",
        "version": "8.15"
    },
    "doc": "[[add-repository]]\n== Troubleshooting broken repositories\n\nThere are several situations where the <<health-api, Health API>> might report an issue\nregarding the integrity of snapshot repositories in the cluster. The following pages explain\nthe recommended actions for diagnosing corrupted, unknown, and invalid repositories:\n\n- <<diagnosing-corrupted-repositories>>\n- <<diagnosing-unknown-repositories>>\n- <<diagnosing-invalid-repositories>>\n\n[[diagnosing-corrupted-repositories]]\n=== Diagnosing corrupted repositories\n\nMultiple {es} deployments are writing to the same snapshot repository. {es} doesn't\nsupport this configuration and only one cluster is allowed to write to the same\nrepository. See <<snapshot-repository-contents>> for potential side-effects of\ncorruption of the repository contents, which may not be resolved by the following\nguide.\nTo remedy the situation mark the repository as read-only or remove it from all the\nother deployments, and re-add (recreate) the repository in the current deployment:\n\ninclude::{es-ref-dir}/tab-widgets/troubleshooting/snapshot/corrupt-repository-widget.asciidoc[]\n\n\n[[diagnosing-unknown-repositories]]\n=== Diagnosing unknown repositories\n\nWhen a snapshot repository is marked as \"unknown\", it means that an {es} node is\nunable to instantiate the repository due to an unknown repository type. This is\nusually caused by a missing plugin on the node. Make sure each node in the cluster\nhas the required plugins by following the following steps:\n\n1. Retrieve the affected nodes from the affected resources section of the health report.\n2. Use the <<cluster-nodes-info,nodes info API>> to retrieve the plugins installed on each node.\n3. Cross reference this with a node that works correctly to find out which plugins are missing\nand install the missing plugins.\n\n\n[[diagnosing-invalid-repositories]]\n=== Diagnosing invalid repositories\n\nWhen an {es} node faces an unexpected exception when trying to instantiate a snapshot\nrepository, it will mark the repository as \"invalid\" and write a warning to the log file.\nUse the following steps to diagnose the underlying cause of this issue:\n\n1. Retrieve the affected nodes from the affected resources section of the health report.\n2. Refer to the logs of the affected node(s) and search for the repository name.\nYou should be able to find logs that will contain relevant exception.\n3. Try to resolve the errors reported.\n"
}