{
    "meta": {
        "timestamp": "2024-11-01T02:49:25.932068",
        "size": 2522,
        "url": "https://www.elastic.co/guide/en/elasticsearch/reference/current/breaking_80_plugin_changes.html",
        "type": "documentation",
        "role": [],
        "has_code": false,
        "title": "breaking_80_plugin_changes",
        "version": "8.15"
    },
    "doc": "[discrete]\n[[breaking_80_plugin_changes]]\n==== Plugin changes\n\nTIP: {ess-skip-section}\n\n.The S3, GCS and Azure repository plugins are now included in Elasticsearch\n[%collapsible]\n====\n*Details* +\nIn previous versions of {es}, in order to register a snapshot repository\nbacked by Amazon S3, Google Cloud Storage (GCS) or Microsoft Azure Blob\nStorage, you first had to install the corresponding Elasticsearch plugin,\nfor example `repository-s3`. These plugins are now included in {es} by\ndefault.\n\n*Impact* +\nYou no longer need to install the following plugins, and not should attempt\nto do so.\n\n* `repository-azure`\n* `repository-gcs`\n* `repository-s3`\n\n{es} and the `elasticsearch-plugin` CLI tool have been changed to tolerate\nattempted installation and removal of these plugins in order to avoid\nbreaking any existing automation. In the future, attempting to install\nthese plugins will be an error.\n\nSpecifically, the `elasticsearch-plugin` CLI tool will not fail if you\nattempt to install any of the above plugins, and will instead print a\nwarning and skip the plugins. If any of these plugins are already\ninstalled, for example because you installed them when running an older\nversion of {es}, then you can still remove them with\n`elasticsearch-plugin`. Attempting to remove them if they are not installed\nwill succeed but print a warnings.\n\nIf you run {es} using Docker and you are managing plugins using a\n{plugins}/manage-plugins-using-configuration-file.html[configuration file], then when\n{es} first starts after you upgrade it, it will remove the above plugins if\nthey already installed. If any of these plugins are specified in your\nconfiguration file, {es} will ignore them and emit a warning log message.\n====\n\n.Third party plugins can no longer intercept REST requests (`RestHandlerWrapper`)\n[%collapsible]\n====\n*Details* +\nIn previous versions of {es}, third-party plugins could implement the \n`getRestHandlerWrapper` method to intercept all REST requests to the node. A \ncommon use of this feature was to implement custom security plugins to replace\nthe built-in {security-features}. This extension point is no longer available\nto third-party plugins.\n\n\n*Impact* +\nSome third-party plugins that were designed to work with earlier versions of\n{es} might not be compatible with {es} version 8.0 or later.\n\nIf you depend on any plugins that are not produced and supported by Elastic,\ncheck with the plugin author and ensure that the plugin is available for your\ntarget version of {es} before upgrading.\n\n====\n"
}