{
    "meta": {
        "size": 4426,
        "url": "https://www.elastic.co/guide/en/elasticsearch/reference/current/breaking_80_mapping_changes.html",
        "type": "documentation",
        "role": [],
        "has_code": false,
        "title": "breaking_80_mapping_changes",
        "version": "8.15"
    },
    "doc": "[discrete]\n[[breaking_80_mapping_changes]]\n==== Mapping changes\n\n.Indices created in {es} 6.x and earlier versions are not supported.\n[%collapsible]\n====\n*Details* +\nElasticsearch 8.0 can read indices created in version 7.0 or above. An\nElasticsearch 8.0 node will not start in the presence of indices created in a\nversion of Elasticsearch before 7.0.\n\n*Impact* +\nReindex indices created in {es} 6.x or before with {es} 7.x if they need to be carried forward to  {es} 8.x.\n====\n\n.Closed indices created in {es} 6.x and earlier versions are not supported.\n[%collapsible]\n====\n*Details* +\nIn earlier versions a node would start up even if it had data from indices\ncreated in a version before the previous major version, as long as those\nindices were closed. {es} now ensures that it is compatible with every index,\nopen or closed, at startup time.\n\n*Impact* +\nReindex closed indices created in {es} 6.x or before with {es} 7.x if they need\nto be carried forward to {es} 8.x.\n====\n\n.The maximum number of completion contexts per field is now 10.\n[%collapsible]\n====\n*Details* +\nThe number of completion contexts within a single completion field\nhas been limited to 10.\n\n*Impact* +\nUse a maximum of 10 completion contexts in a completion field. Specifying more\nthan 10 completion contexts will return an error.\n====\n\n.Multi-fields within multi-fields is no longer supported.\n[%collapsible]\n====\n*Details* +\nPreviously, it was possible to define a multi-field within a multi-field.\nDefining chained multi-fields was deprecated in 7.3 and is now no longer\nsupported.\n\n*Impact* +\nTo migrate mappings, all instances of `fields` that occur within\na `fields` block should be removed, either by flattening the chained `fields`\nblocks into a single level, or by switching to `copy_to` if appropriate.\n====\n\n[[fieldnames-enabling]]\n.The `_field_names` metadata field's `enabled` parameter has been removed.\n[%collapsible]\n====\n*Details* +\nThe setting has been deprecated with 7.5 and is no longer supported on new indices.\nMappings for older indices will continue to work but emit a deprecation warning.\n\n*Impact* +\nThe `enabled` setting for `_field_names` should be removed from templates and mappings.\nDisabling _field_names is not necessary because it no longer carries a large index overhead.\n====\n\n[[mapping-boosts]]\n.The `boost` parameter on field mappings has been removed.\n[%collapsible]\n====\n*Details* +\nIndex-time boosts have been deprecated since the 5x line, but it was still possible\nto declare field-specific boosts in the mappings. This is now removed completely.\nIndexes built in 7x that contain mapping boosts will emit warnings, and the boosts\nwill have no effect in 8.0. New indexes will not permit boosts to be set in their\nmappings at all.\n\n*Impact* +\nThe `boost` setting should be removed from templates and mappings. Use boosts\ndirectly on queries instead.\n====\n\n.Java-time date formats replace joda-time formats.\n[%collapsible]\n====\n*Details* +\nIn 7.0, {es} switched from joda time to java time for date-related parsing,\nformatting, and calculations. Indices created in 7.0 and later versions are\nalready required to use mappings with java-time date formats. However,\nearlier indices using joda-time formats must be reindexed to use\nmappings with java-time formats.\n\n*Impact* +\nFor a detailed migration guide, see the {ref}/migrate-to-java-time.html[Java\ntime migration guide].\n====\n\n[[geo-shape-strategy]]\n.Several `geo_shape` mapping parameters have been removed.\n[%collapsible]\n====\n*Details* +\nThe following `geo_shape` mapping parameters were deprecated in 6.6:\n\n* `tree`\n* `tree_levels`\n* `strategy`\n* `distance_error_pct`\n\nThese parameters have been removed in 8.0.0.\n\n*Impact* +\nIn 8.0, you can no longer create mappings that include these parameters.\nHowever, 7.x indices that use these mapping parameters will continue to work.\n====\n\n.The `sparse_vector` field data type has been removed.\n[%collapsible]\n====\n*Details* +\nThe `sparse_vector` field type was deprecated in 7.6 and is now removed in\n8.0. We have not seen much interest in this experimental field type, and don't\nsee a clear use case as it's currently designed. If you have feedback or\nsuggestions around sparse vector functionality, please let us know through\nGitHub or the 'discuss' forums.\n\n*Impact* +\nDiscontinue use of the `sparse_vector` field data type. Requests containing\na mapping for this field data type will return an error.\n====\n"
}