{
    "meta": {
        "timestamp": "2024-11-01T02:49:24.603068",
        "size": 2719,
        "url": "https://www.elastic.co/guide/en/elasticsearch/reference/current/ccr-settings.html",
        "type": "documentation",
        "role": [
            "xpack"
        ],
        "has_code": false,
        "title": "ccr-settings",
        "version": "8.15"
    },
    "doc": "[role=\"xpack\"]\n[[ccr-settings]]\n=== {ccr-cap} settings\n\nThese {ccr} settings can be dynamically updated on a live cluster with the\n<<cluster-update-settings,cluster update settings API>>.\n\n[discrete]\n[[ccr-recovery-settings]]\n==== Remote recovery settings\n\nThe following setting can be used to rate-limit the data transmitted during\n<<ccr-remote-recovery,remote recoveries>>:\n\n`ccr.indices.recovery.max_bytes_per_sec` (<<cluster-update-settings,Dynamic>>)::\nLimits the total inbound and outbound remote recovery traffic on each node.\nSince this limit applies on each node, but there may be many nodes performing\nremote recoveries concurrently, the total amount of remote recovery bytes may be\nmuch higher than this limit. If you set this limit too high then there is a risk\nthat ongoing remote recoveries will consume an excess of bandwidth (or other\nresources) which could destabilize the cluster. This setting is used by both the\nleader and follower clusters. For example if it is set to `20mb` on a leader,\nthe leader will only send `20mb/s` to the follower even if the follower is\nrequesting and can accept `60mb/s`. Defaults to `40mb`.\n\n[discrete]\n[[ccr-advanced-recovery-settings]]\n==== Advanced remote recovery settings\n\nThe following _expert_ settings can be set to manage the resources consumed by\nremote recoveries:\n\n`ccr.indices.recovery.max_concurrent_file_chunks` (<<cluster-update-settings,Dynamic>>)::\nControls the number of file chunk requests that can be sent in parallel per\nrecovery. As multiple remote recoveries might already running in parallel,\nincreasing this expert-level setting might only help in situations where remote\nrecovery of a single shard is not reaching the total inbound and outbound remote recovery traffic as configured by `ccr.indices.recovery.max_bytes_per_sec`.\nDefaults to `5`. The maximum allowed value is `10`.\n\n`ccr.indices.recovery.chunk_size`(<<cluster-update-settings,Dynamic>>)::\nControls the chunk size requested by the follower during file transfer. Defaults to\n`1mb`.\n\n`ccr.indices.recovery.recovery_activity_timeout`(<<cluster-update-settings,Dynamic>>)::\nControls the timeout for recovery activity. This timeout primarily applies on\nthe leader cluster. The leader cluster must open resources in-memory to supply\ndata to the follower during the recovery process. If the leader does not receive recovery requests from the follower for this period of time, it will close the resources. Defaults to 60 seconds.\n\n`ccr.indices.recovery.internal_action_timeout` (<<cluster-update-settings,Dynamic>>)::\nControls the timeout for individual network requests during the remote recovery\nprocess. An individual action timing out can fail the recovery. Defaults to\n60 seconds.\n"
}