{
    "meta": {
        "size": 2651,
        "url": "https://www.elastic.co/guide/en/elasticsearch/reference/current/kerberos-realm.html",
        "type": "documentation",
        "role": [
            "xpack"
        ],
        "has_code": false,
        "title": "kerberos-realm",
        "version": "8.15"
    },
    "doc": "[role=\"xpack\"]\n[[kerberos-realm]]\n=== Kerberos authentication\n\nYou can configure the {stack} {security-features} to support Kerberos V5\nauthentication, an industry standard protocol to authenticate users in {es}.\n\nNOTE: You cannot use the Kerberos realm to authenticate on the transport network layer.\n\nTo authenticate users with Kerberos, you need to configure a Kerberos realm and\nmap users to roles. For more information on realm settings, see\n<<ref-kerberos-settings>>.\n\n[[kerberos-terms]]\n==== Key concepts\n\nThere are a few terms and concepts that you'll encounter when you're setting up \nKerberos realms:\n\n_kdc_::\nKey Distribution Center. A service that issues Kerberos tickets.\n\n_principal_::\nA Kerberos principal is a unique identity to which Kerberos can assign\ntickets. It can be used to identify a user or a service provided by a\nserver.\n+\n--\nKerberos V5 principal names are of format `primary/instance@REALM`, where\n`primary` is a user name.\n\n`instance` is an optional string that qualifies the primary and is separated\nby a slash(`/`) from the primary. For a user, usually it is not used; for\nservice hosts, it is the fully qualified domain name of the host.\n\n`REALM` is the Kerberos realm. Usually it is the domain name in upper case.\nAn example of a typical user principal is `user@ES.DOMAIN.LOCAL`. An example of \na typical service principal is `HTTP/es.domain.local@ES.DOMAIN.LOCAL`.\n--\n\n_realm_::\nRealms define the administrative boundary within which the authentication server\nhas authority to authenticate users and services.\n\n_keytab_::\nA file that stores pairs of principals and encryption keys.\n\nIMPORTANT: Anyone with read permissions to this file can use the\ncredentials in the network to access other services so it is important\nto protect it with proper file permissions.\n\n_krb5.conf_::\nA file that contains Kerberos configuration information such as the default realm\nname, the location of Key distribution centers (KDC), realms information,\nmappings from domain names to Kerberos realms, and default configurations for\nrealm session key encryption types.\n\n_ticket granting ticket (TGT)_::\nA TGT is an authentication ticket generated by the Kerberos authentication\nserver. It contains an encrypted authenticator.\n\n[[kerberos-realm-configuration]]\n==== Configuring a Kerberos realm\n\ninclude::configuring-kerberos-realm.asciidoc[]\n\n[[kerberos-realm-kibana]]\n===== Configure Kibana for Kerberos\n\nIf you want to use Kerberos to authenticate via your browser and {kib}, you\nneed to enable the relevant authentication provider in {kib} configuration. See\n{kibana-ref}/kibana-authentication.html#kerberos[kerberos single sign-on]\n"
}