{
    "meta": {
        "timestamp": "2024-11-01T03:07:09.650274",
        "size": 3965,
        "url": "https://www.elastic.co/guide/en/elasticsearch/reference/current/migrating-8.12.html",
        "type": "documentation",
        "role": [],
        "has_code": false,
        "title": "migrating-8.12",
        "version": "8.15"
    },
    "doc": "[[migrating-8.12]]\n== Migrating to 8.12\n++++\n<titleabbrev>8.12</titleabbrev>\n++++\n\nThis section discusses the changes that you need to be aware of when migrating\nyour application to {es} 8.12.\n\nSee also <<release-highlights>> and <<es-release-notes>>.\n\n[discrete]\n[[breaking-changes-8.12]]\n=== Breaking changes\n\nThere are no breaking changes in 8.12\n\n[discrete]\n[[notable-changes-8.12]]\n=== Notable changes\n\nThere are notable changes in 8.12 that you need to be aware of, items that we may consider as notable changes are\n\n* Changes to features that are in Technical Preview.\n* Changes to log formats.\n* Changes to non public APIs.\n* Behaviour changes that repair critical bugs.\n\n\n[discrete]\n[[breaking_812_authorization_changes]]\n==== Authorization changes\n\n[[fixed_jwt_principal_from_claims]]\n.Fixed JWT principal from claims\n[%collapsible]\n====\n*Details* +\nThis changes the format of a JWT's principal before the JWT is actually validated by any JWT realm. The JWT's principal is a convenient way to refer to a JWT that has not yet been verified by a JWT realm. The JWT's principal is printed in the audit and regular logs (notably for auditing authn failures) as well as the smart realm chain reordering optimization. The JWT principal is NOT required to be identical to the JWT-authenticated user's principal, but in general, they should be similar. Previously, the JWT's principal was built by individual realms in the same way the realms built the authenticated user's principal. This had the advantage that, in simpler JWT realms configurations (e.g. a single JWT realm in the chain), the JWT principal and the authenticated user's principal are very similar. However the drawback is that, in general, the JWT principal and the user principal can be very different (i.e. in the case where one JWT realm builds the JWT principal and a different one builds the user principal). Another downside is that the (unauthenticated) JWT principal depended on realm ordering, which makes identifying the JWT from its principal dependent on the ES authn realm configuration. This PR implements a consistent fixed logic to build the JWT principal, which only depends on the JWT's claims and no ES configuration.\n\n*Impact* +\nUsers will observe changed format and values for the `user.name` attribute of `authentication_failed` audit log events, in the JWT (failed) authn case.\n====\n\n[discrete]\n[[breaking_812_java_api_changes]]\n==== Java API changes\n\n[[plugin_createcomponents_method_has_been_refactored_to_take_single_pluginservices_object]]\n.Plugin.createComponents method has been refactored to take a single PluginServices object\n[%collapsible]\n====\n*Details* +\nPlugin.createComponents currently takes several different service arguments. The signature of this method changes every time a new service is added. The method has now been modified to take a single interface object that new services are added to. This will reduce API incompatibility issues when a new service is introduced in the future.\n\n*Impact* +\nPlugins that override createComponents will need to be refactored to override the new method on ES 8.12+\n====\n\n[discrete]\n[[breaking_812_rest_api_changes]]\n==== REST API changes\n\n[[es_ql_pow_function_always_returns_double]]\n.[ES|QL] pow function always returns double\n[%collapsible]\n====\n*Details* +\nThis corrects an earlier mistake in the ES|QL language design. Initially we had thought to have pow return the same type as its inputs, but in practice even for integer inputs this quickly grows out of the representable range, and we returned null much of the time. This also created a lot of edge cases around casting to/from doubles (which the underlying java function uses). The version in this PR follows the java spec, by always casting its inputs to doubles, and returning a double. Doing it this way also allows for a rather significant reduction in lines of code.\n\n*Impact* +\nlow. Most queries should continue to function with the change.\n====\n\n"
}