{
    "meta": {
        "timestamp": "2024-11-01T02:49:25.373069",
        "size": 2277,
        "url": "https://www.elastic.co/guide/en/elasticsearch/reference/current/overview-index-lifecycle-management.html",
        "type": "documentation",
        "role": [
            "xpack"
        ],
        "has_code": false,
        "title": "overview-index-lifecycle-management",
        "version": "8.15"
    },
    "doc": "[role=\"xpack\"]\n[[overview-index-lifecycle-management]]\n== {ilm-init} overview\n\n++++\n<titleabbrev>Overview</titleabbrev>\n++++\n\nYou can create and apply {ilm-cap} ({ilm-init}) policies to automatically manage your indices\naccording to your performance, resiliency, and retention requirements.\n\nIndex lifecycle policies can trigger actions such as:\n\n* **Rollover**: Creates a new write index when the current one reaches a certain\nsize, number of docs, or age.\n* **Shrink**: Reduces the number of primary shards in an index.\n* **Force merge**: Triggers a <<indices-forcemerge,force merge>> to reduce the\nnumber of segments in an index's shards.\n* **Delete**: Permanently remove an index, including all of its data and\nmetadata.\n\n{ilm-init} makes it easier to manage indices in hot-warm-cold architectures,\nwhich are common when you're working with time series data such as logs and metrics.\n\nYou can specify:\n\n* The maximum shard size, number of documents, or age at which you want to roll over to a new index.\n* The point at which the index is no longer being updated and the number of\nprimary shards can be reduced.\n* When to force a merge to permanently remove documents marked for deletion.\n* The point at which the index can be moved to less performant hardware.\n* The point at which the availability is not as critical and the number of\nreplicas can be reduced.\n* When the index can be safely deleted.\n\nFor example, if you are indexing metrics data from a fleet of ATMs into\nElasticsearch, you might define a policy that says:\n\n. When the total size of the index's primary shards reaches 50GB, roll over to a new\nindex.\n. Move the old index into the warm phase, mark it read only, and shrink it down\nto a single shard.\n. After 7 days, move the index into the cold phase and move it to less expensive\nhardware.\n. Delete the index once the required 30 day retention period is reached.\n\n[IMPORTANT]\n===========================\nTo use {ilm-init}, all nodes in a cluster must run the same version.\nAlthough it might be possible to create and apply policies in a mixed-version cluster,\nthere is no guarantee they will work as intended.\nAttempting to use a policy that contains actions that aren't\nsupported on all nodes in a cluster will cause errors.\n===========================\n"
}