{
    "meta": {
        "timestamp": "2024-11-01T03:07:10.596277",
        "size": 1639,
        "url": "https://www.elastic.co/guide/en/elasticsearch/reference/current/release-notes-8.10.4.html",
        "type": "documentation",
        "role": [],
        "has_code": false,
        "title": "release-notes-8.10.4",
        "version": "8.15"
    },
    "doc": "[[release-notes-8.10.4]]\n== {es} version 8.10.4\n\n[[known-issues-8.10.4]]\n[float]\n=== Known issues\n\n* Snapshot-based downgrades\n+\nThe snapshot repository format changed in a manner that prevents earlier\nversions of Elasticsearch from reading the repository contents if it contains\nsnapshots from this version and the last cluster to write to this repository was\nin the 8.10 series. This will prevent you from reverting an upgrade to the 8.10\nseries by restoring a snapshot taken before the upgrade.\n+\nSnapshot repositories written by clusters running versions 8.11.0 and later are\ncompatible with all earlier versions. Moreover, clusters running version 8.11.0\nor later will also automatically repair the repository format the first time\nthey write to the repository to take or delete a snapshot, making it so that all\nearlier versions can read its contents again.\n+\nIf you wish to downgrade to a version prior to 8.10.0, take or delete a snapshot\nusing a cluster running version 8.11.0 or later to repair the repository format\nfirst. If you cannot repair the repository in this way, first delete all the\nsnapshots in the repository taken with version 8.10.0 or later using a cluster\nrunning version 8.10.4.\n\ninclude::8.10.3.asciidoc[tag=no-preventive-gc-issue]\n\nAlso see <<breaking-changes-8.10,Breaking changes in 8.10>>.\n\n[[bug-8.10.4]]\n[float]\n=== Bug fixes\n\nSearch::\n* Search of remote clusters with no shards results in successful status {es-pull}100354[#100354]\n\nSnapshot/Restore::\n* Improve `RepositoryData` BwC {es-pull}100401[#100401]\n\nTransform::\n* Shutdown the task immediately when `force` == `true` {es-pull}100203[#100203]\n\n\n"
}