{
    "meta": {
        "timestamp": "2024-11-01T02:49:26.267067",
        "size": 6254,
        "url": "https://www.elastic.co/guide/en/elasticsearch/reference/current/rollup-search-limitations.html",
        "type": "documentation",
        "role": [
            "xpack"
        ],
        "has_code": true,
        "title": "rollup-search-limitations",
        "version": "8.15"
    },
    "doc": "[role=\"xpack\"]\n[[rollup-search-limitations]]\n=== {rollup-cap} search limitations\n\ndeprecated::[8.11.0,\"Rollups will be removed in a future version. Please <<rollup-migrating-to-downsampling,migrate>> to <<downsampling,downsampling>> instead.\"]\n\nWhile we feel the Rollup function is extremely flexible, the nature of summarizing data means there will be some limitations. Once\nlive data is thrown away, you will always lose some flexibility.\n\nThis page highlights the major limitations so that you are aware of them.\n\n[discrete]\n==== Only one {rollup} index per search\n\nWhen using the <<rollup-search>> endpoint, the `index` parameter accepts one or more indices. These can be a mix of regular, non-rollup\nindices and rollup indices. However, only one rollup index can be specified. The exact list of rules for the `index` parameter are as\nfollows:\n\n- At least one index/index-pattern must be specified. This can be either a rollup or non-rollup index. Omitting the index parameter,\nor using `_all`, is not permitted\n- Multiple non-rollup indices may be specified\n- Only one rollup index may be specified. If more than one are supplied an exception will be thrown\n- Index patterns may be used, but if they match more than one rollup index an exception will be thrown.\n\nThis limitation is driven by the logic that decides which jobs are the \"best\" for any given query. If you have ten jobs stored in a single\nindex, which cover the source data with varying degrees of completeness and different intervals, the query needs to determine which set\nof jobs to actually search. Incorrect decisions can lead to inaccurate aggregation results (e.g. over-counting doc counts, or bad metrics).\nNeedless to say, this is a technically challenging piece of code.\n\nTo help simplify the problem, we have limited search to just one rollup index at a time (which may contain multiple jobs). In the future we\nmay be able to open this up to multiple rollup jobs.\n\n[discrete]\n[[aggregate-stored-only]]\n==== Can only aggregate what's been stored\n\nA perhaps obvious limitation, but rollups can only aggregate on data that has been stored in the rollups. If you don't configure the\nrollup job to store metrics about the `price` field, you won't be able to use the `price` field in any query or aggregation.\n\nFor example, the `temperature` field in the following query has been stored in a rollup job... but not with an `avg` metric. Which means\nthe usage of `avg` here is not allowed:\n\n[source,console]\n--------------------------------------------------\nGET sensor_rollup/_rollup_search\n{\n  \"size\": 0,\n  \"aggregations\": {\n    \"avg_temperature\": {\n      \"avg\": {\n        \"field\": \"temperature\"\n      }\n    }\n  }\n}\n--------------------------------------------------\n// TEST[setup:sensor_prefab_data]\n// TEST[catch:/illegal_argument_exception/]\n\nThe response will tell you that the field and aggregation were not possible, because no rollup jobs were found which contained them:\n\n[source,console-result]\n----\n{\n  \"error\": {\n    \"root_cause\": [\n      {\n        \"type\": \"illegal_argument_exception\",\n        \"reason\": \"There is not a rollup job that has a [avg] agg with name [avg_temperature] which also satisfies all requirements of query.\",\n        \"stack_trace\": ...\n      }\n    ],\n    \"type\": \"illegal_argument_exception\",\n    \"reason\": \"There is not a rollup job that has a [avg] agg with name [avg_temperature] which also satisfies all requirements of query.\",\n    \"stack_trace\": ...\n  },\n  \"status\": 400\n}\n----\n// TESTRESPONSE[s/\"stack_trace\": \\.\\.\\./\"stack_trace\": $body.$_path/]\n\n[discrete]\n==== Interval granularity\n\nRollups are stored at a certain granularity, as defined by the `date_histogram` group in the configuration. This means you\ncan only search/aggregate the rollup data with an interval that is greater-than or equal to the configured rollup interval.\n\nFor example, if data is rolled up at hourly intervals, the <<rollup-search>> API can aggregate on any time interval\nhourly or greater. Intervals that are less than an hour will throw an exception, since the data simply doesn't\nexist for finer granularities.\n\n[[rollup-search-limitations-intervals]]\n.Requests must be multiples of the config\n**********************************\nPerhaps not immediately apparent, but the interval specified in an aggregation request must be a whole\nmultiple of the configured interval. If the job was configured to rollup on `3d` intervals, you can only\nquery and aggregate on multiples of three (`3d`, `6d`, `9d`, etc).\n\nA non-multiple wouldn't work, since the rolled up data wouldn't cleanly \"overlap\" with the buckets generated\nby the aggregation, leading to incorrect results.\n\nFor that reason, an error is thrown if a whole multiple of the configured interval isn't found.\n**********************************\n\nBecause the RollupSearch endpoint can \"upsample\" intervals, there is no need to configure jobs with multiple intervals (hourly, daily, etc).\nIt's recommended to just configure a single job with the smallest granularity that is needed, and allow the search endpoint to upsample\nas needed.\n\nThat said, if multiple jobs are present in a single rollup index with varying intervals, the search endpoint will identify and use the job(s)\nwith the largest interval to satisfy the search request.\n\n[discrete]\n==== Limited querying components\n\nThe Rollup functionality allows `query`'s in the search request, but with a limited subset of components. The queries currently allowed are:\n\n- Term Query\n- Terms Query\n- Range Query\n- MatchAll Query\n- Any compound query (Boolean, Boosting, ConstantScore, etc)\n\nFurthermore, these queries can only use fields that were also saved in the rollup job as a `group`.\nIf you wish to filter on a keyword `hostname` field, that field must have been configured in the rollup job under a `terms` grouping.\n\nIf you attempt to use an unsupported query, or the query references a field that wasn't configured in the rollup job, an exception will be\nthrown. We expect the list of support queries to grow over time as more are implemented.\n\n[discrete]\n==== Timezones\n\nRollup documents are stored in the timezone of the `date_histogram` group configuration in the job. If no timezone is specified, the default\nis to rollup timestamps in `UTC`.\n\n"
}