{
    "meta": {
        "timestamp": "2024-11-01T03:02:52.213582",
        "size": 18671,
        "url": "https://www.elastic.co/guide/en/elasticsearch/reference/current/sql-odbc-setup.html",
        "type": "documentation",
        "role": [
            "xpack"
        ],
        "has_code": false,
        "title": "sql-odbc-setup",
        "version": "8.15"
    },
    "doc": "[role=\"xpack\"]\n[[sql-odbc-setup]]\n=== Configuration\n\nOnce the driver has been installed, in order for an application to be able to connect to {es} through ODBC, a set of configuration parameters must be provided to the driver. Depending on the application, there are generally three ways of providing these parameters:\n\n* through a connection string;\n* using a User DSN or System DSN;\n* through a File DSN.\n\nDSN (_data source name_) is a generic name given to the set of parameters an ODBC driver needs to connect to a database.\n\nWe will refer to these parameters as _connection parameters_ or _DSN_ (despite some of these parameters configuring some other aspects of a driver's functions; e.g. logging, buffer sizes...).\n\nUsing a DSN is the most widely used, simplest and safest way of performing the driver configuration. Constructing a connection string, on the other hand, is the most crude way and consequently the least common method.\n\nWe will focus on DSN usage only.\n\n[[data-source-administrator]]\n==== 1. Launching ODBC Data Source Administrator\n\nFor DSN management, ODBC provides the _ODBC Data Source Administrator_ application, readily installed on all recent desktop Windows operating systems.\n\n- The 32-bit version of the Odbcad32.exe file is located in the `%systemdrive%\\Windows\\SysWoW64` folder.\n- The 64-bit version of the Odbcad32.exe file is located in the `%systemdrive%\\Windows\\System32` folder.\n\nTo launch it, open the search menu - _Win + S_ - and type \"ODBC Data Sources (64-bit)\" or \"ODBC Data Sources (32-bit)\" and press _Enter_:\n\n[[launch_administrator]]\n.Launching ODBC Data Source Administrator\nimage:images/sql/odbc/launch_administrator.png[]\n\nOnce launched, you can verify that the driver was installed correctly by clicking on the _Drivers_ tab of the ODBC Data Source Administrator and checking that _Elasticsearch Driver_ is present in the list of installed drivers.\n\nYou should also see the version number of the installed driver.\n\n[[administrator_drivers]]\n.Drivers tab\nimage:images/sql/odbc/administrator_drivers.png[]\n\n[[dsn-configuration]]\n==== 2. Configure a DSN\nThe next step is to configure a DSN. You can choose between the following options mapped on the first three tabs of the Administrator application:\n\n* User DSN\n+\nThe connections configured under this tab are only available to the currently logged in user. Each of these DSNs are referred to by a chosen arbitrary name (typically a host or cluster name).\n+\nThe actual set of parameters making up the DSN is stored through the driver in the system registry. Thus, a user will later only need to provide an application with the DSN name in order to connect to the configured {es} instance.\n+\n* System DSN\n+\nSimilar to a User DSN, except that the connections configured under this tab will be available to all the users configured on the system.\n* File DSN\n+\nThis tab contains functionality that will allow to have one set of connection parameters written into a file, rather then the Registry.\n+\nSuch a file can be then shared among multiple systems and the user will need to specify the path to it, in order to have the application connect to the configured {es} instance.\n\nThe configuration steps are similar for all the above points. Following is an example of configuring a System DSN.\n\n[discrete]\n===== 2.1 Launch {odbc} DSN Editor\nClick on the _System DSN_ tab, then on the _Add..._ button:\n\n[[system_add]]\n.Add a new DSN\nimage:images/sql/odbc/administrator_system_add.png[]\n\nA new window will open, listing all available installed drivers. Click on _{es} Driver_, to highlight it, then on the _Finish_ button:\n\n[[launch_editor]]\n.Launch the DSN Editor\nimage:images/sql/odbc/administrator_launch_editor.png[]\n\nThis action closes the previously opened second window and open a new one instead, {odbc}'s DSN Editor:\n\n[[dsn_editor]]\n.{odbc} DSN Editor\nimage:images/sql/odbc/dsn_editor_basic.png[]\n\nThis new window has three tabs, each responsible for a set of configuration parameters, as follows.\n\n[discrete]\n[[connection_parameters]]\n===== 2.2 Connection parameters\nThis tab allows configuration for the following items:\n\n* Name\n+\nThis is the name the DSN will be referred by.\n+\nNOTE: The characters available for this field are limited to the set permitted for a Registry key.\n+\nExample: _localhost_\n+\n* Description\n+\nThis field allows a arbitrary text; generally used for short notes about the configured connection.\n+\nExample: _Clear-text connection to the local [::1]:9200._\n+\n* Cloud ID\n+\nThe _Cloud ID_ is a string that simplifies the configuration when connecting to\nElastic's Cloud {ess}; it is obtained from within the Cloud console of each\n{es} cluster and encodes the connection parameters to that cluster.\n+\nNOTE: When this field is provisioned, the _Hostname_, _Port_ and the security\nsettings are provisioned as well and their respective inputs disabled.\n+\n* Hostname\n+\nThis field requires an IP address or a resolvable DNS name of the {es} instance that the driver will connect to.\n+\nExample: _::1_\n+\n* Port\n+\nThe port on which the {es} listens on.\n+\nNOTE: If left empty, the default *9200* port number will be used.\n+\n* Username, Password\n+\nIf security is enabled, these fields will need to contain the credentials of the access user.\n\nAt a minimum, the _Name_ and _Hostname_ fields must be provisioned, before the DSN can be saved.\n\nWARNING: Connection encryption is enabled by default. This will need to be changed if connecting to an {es} node with no encryption.\n\n[discrete]\n===== 2.3 Cryptography parameters\nOne of the following SSL options can be chosen:\n\n* Disabled. All communications unencrypted.\n+\nThe communication between the driver and the {es} instance is performed over a clear-text connection.\n+\nWARNING: This setting can expose the access credentials to a 3rd party intercepting the network traffic and is not recommended.\n+\n* Enabled. Certificate not validated.\n+\nThe connection encryption is enabled, but the certificate of the server is not validated.\n+\nThis is currently the default setting.\n+\nNOTE: This setting allows a 3rd party to act with ease as a man-in-the-middle and thus intercept all communications.\n+\n* Enabled. Certificate is validated; hostname not validated.\n+\nThe connection encryption is enabled and the driver verifies that server's certificate is valid, but it does *not* verify if the\ncertificate is running on the server it was meant for.\n+\nNOTE: This setting allows a 3rd party that had access to server's certificate to act as a man-in-the-middle and thus intercept all the\ncommunications.\n+\n* Enabled. Certificate is validated; hostname validated.\n+\nThe connection encryption is enabled and the driver verifies that both the certificate is valid, as well as that it is being deployed on\nthe server that the certificate was meant for.\n+\n* Enabled. Certificate identity chain validated.\n+\nThis setting is equivalent to the previous one, with one additional check against certificate's revocation. This offers the strongest\nsecurity option and is the recommended setting for production deployments.\n+\n* Certificate File\n+\nIn case the server uses a certificate that is not part of the PKI, for example using a self-signed certificate, you can configure the path to a X.509 certificate file that will be used by the driver to validate server's offered certificate.\n+\nThe driver will only read the contents of the file just before a connection is attempted. See <<connection_testing>> section further on how to check the validity of the provided parameters.\n+\nNOTE: The certificate file can not be bundled or password protected since the driver will not prompt for a password.\n+\nIf using the file browser to locate the certificate - by pressing the _Browse..._ button - only files with _.pem_ and _.der_ extensions\nwill be considered by default. Choose _All Files (\\*.*)_ from the drop down, if your file ends with a different extension:\n+\n[[dsn_editor_cert]]\n.Certificate file browser\nimage:images/sql/odbc/dsn_editor_security_cert.png[]\n\n[discrete]\n===== 2.4 Proxy parameters\nIf connecting to the {es} node needs to go through a proxy, the following parameters need to be configured:\n\n* Type\n+\nWhat kind of protocol to use when connecting to the proxy host. This also mandates how the {es} node you want to connect to over the proxy needs to be specified under <<connection_parameters>>:\n+\n** HTTP, SOCKS4A, SOCKS5H: either IP address or host name is accepted; the proxy will resolve the DNS name;\n** SOCKS4, SOCKS5: {es} node location needs to be provided as an IP address;\n+\n* Port\n+\nThe TCP port the proxy is listening for connections on.\n* Username\n+\nThe user part of the credentials used to authenticate to the proxy.\n* Password\n+\nThe password part of the credentials for the proxy.\n\n\n[[dsn_editor_proxy]]\n.Proxy parameters\nimage:images/sql/odbc/dsn_editor_proxy.png[]\n\n[discrete]\n===== 2.5 Connection parameters\nThe connection configuration can further be tweaked by the following parameters.\n\n* Request timeout (s)\n+\nThe maximum time (in seconds) a request to the server can take. This can be\noverridden by a larger statement-level timeout setting. The value 0 means no\ntimeout.\n+\n* Max page size (rows)\n+\nThe maximum number of rows that {es-sql} server should send the driver for one\npage. This corresponds to the SQL search API's\n<<sql-search-api-fetch-size,`fetch_size`>> parameter. A `0` value indicates a\nserver default.\n+\n* Max page length (MB)\n+\nThe maximum size (in megabytes) that an answer can grow to, before being\nrejected as too large by the driver.\nThis is concerning the HTTP answer body of one page, not the cumulated data\nvolume that a query might generate.\n+\n* Varchar limit\n+\nThe maximum width of the string columns.\nIf this setting is greater than zero, the driver will advertise all the string\ntype columns as having a maximum character length equal to this value and will\ntruncate any longer string to it. The string types are textual fields\n(TEXT, KEYWORD etc.) and some specialized fields (IP, the GEOs etc.). Note that\nno interpretation of the value is performed before truncation, which can lead\nto invalid values if the limit is set too low.\nThis is required for those applications that do not support column lengths as\nlarge as {es} fields can be.\n+\n* Floats format\n+\nControls how the floating point numbers will be printed, when these are\nconverted to string by the driver. Possible values given to this parameter:\n+\n** `scientific`: the exponential notation (ex.: 1.23E01);\n\n** `default`: the default notation (ex.: 12.3);\n\n** `auto`: the driver will choose one of the above depending on the value to be\nprinted.\nNote that the number of decimals is dependent on the precision (or ODBC scale)\nof the value being printed and varies with the different floating point types\nsupported by {es-sql}.\nThis setting is not effective when the application fetches from the driver the\nvalues as numbers and then does the conversion subsequently itself.\n+\n* Data encoding\n+\nThis value controls which data format to encode the REST content in. Possible\nvalues are:\n+\n** `CBOR`: use the Concise Binary Object Representation format. This is the\npreferred encoding, given its more compact format.\n\n** `JSON`: use the JavaScript Object Notation format. This format is more\nverbose, but easier to read, especially useful if troubleshooting.\n+\n* Data compression\n+\nThis setting controls if and when the REST content - encoded in one of the above\nformats -  is going to be compressed. The possible values are:\n\n** `on`: enables the compression;\n\n** `off`: disables the compression;\n\n** `auto`: enables the compression, except for the case when the data flows\nthrough a secure connection; since in this case the encryption layer employs\nits own data compression and there can be security implications when an\nadditional compression is enabled, the setting should be kept to this value.\n+\n* Follow HTTP redirects\n+\nShould the driver follow HTTP redirects of the requests to the server?\n+\n* Use local timezone\n+\nThis setting controls the timezone of:\n+\n** the context in which the query will execute (especially relevant for functions dealing with timestamp components);\n\n** the timestamps received from / sent to the server.\n+\nIf disabled, the UTC timezone will apply; otherwise, the local machine's set\ntimezone.\n+\n* Auto-escape PVAs\n+\nThe pattern-value arguments make use of `_` and `%` as special characters to\nbuild pattern matching values. Some applications however use these chars as\nregular ones, which can lead to {es-sql} returning more data than the app\nintended. With the auto escaping, the driver will inspect the arguments and\nwill escape these special characters if not already done by the application.\n+\n* Multi value field lenient\n+\nThis setting controls the behavior of the server in case a\nmulti-value field is queried. In case this is set and the server encounters\nsuch a field, it will pick a value in the set - without any guarantees of what\nthat will be, but typically the first in natural ascending order - and return\nit as the value for the column. If not set, the server will return an error.\nThis corresponds to the SQL search API's\n<<sql-search-api-field-multi-value-leniency,`field_multi_value_leniency`>>\nparameter.\n+\n* Include frozen indices\n+\nIf this parameter is `true`, the server will include the frozen indices in the\nquery execution.\nThis corresponds to {es-sql}'s request parameter `index_include_frozen`\n+\n* Early query execution\n+\nIf this configuration is set, the driver will execute a statement as soon as the\napplication submits it for preparation - i.e. early - and is functionally\nequivalent to a direct execution. This will only happen if the query lacks\nparameters. Early execution is useful with those applications that inspect the\nresult before actually executing the query. {es-sql} lacks a preparation API,\nso early execution is required for interoperability with these applications.\n\n\n[[dsn_editor_misc]]\n.Connection parameters\nimage:images/sql/odbc/dsn_editor_misc.png[]\n\n[discrete]\n===== 2.6 Logging parameters\nFor troubleshooting purposes, the {odbc} offers functionality to log the API calls that an application makes; this is enabled in the Administrator application:\n\n[[administrator_tracing]]\n.Enable Application ODBC API logging\nimage:images/sql/odbc/administrator_tracing.png[]\n\nHowever, this only logs the ODBC API calls made by the application into the _Driver Manager_ and not those made by the _Driver Manager_ into the driver itself. To enable logging of the calls that the driver receives, as well as internal driver processing events, you can enable driver's logging on Editor's _Logging_ tab:\n\n* Enable Logging?\n+\nTicking this will enable driver's logging. A logging directory is also mandatory when this option is enabled (see the next option).\nHowever the specified logging directory will be saved in the DSN if provided, even if logging is disabled.\n+\n* Log Directory\n+\nHere is to specify which directory to write the log files in.\n+\nNOTE: The driver will create *one log file per connection*, for those connections that generate logging messages.\n+\n* Log Level\n+\nConfigure the verbosity of the logs.\n+\n[[administrator_logging]]\n.Enable driver logging\nimage:images/sql/odbc/dsn_editor_logging.png[]\n+\nWhen authentication is enabled, the password will be redacted from the logs.\n\nNOTE: Debug-logging can quickly lead to the creation of many very large files and generate significant processing overhead. Only enable if\ninstructed so and preferably only when fetching low volumes of data.\n\n[discrete]\n[[connection_testing]]\n===== 2.7 Testing the connection\nOnce the _Hostname_, the _Port_ (if different from implicit default) and the SSL options are configured, you can test if the provided\nparameters are correct by pressing the _Test Connection_ button. This will instruct the driver to connect to the {es} instance and perform\na simple SQL test query. (This will thus require a running {es} instance with the SQL plugin enabled.)\n\n[[dsn_editor_conntest]]\n.Connection testing\nimage:images/sql/odbc/dsn_editor_conntest.png[]\n\nNOTE: When connection testing, all the configured parameters are taken into account, including the logging configuration. This will allow\nearly detection of potential file/directory access rights conflicts.\n\nSee <<alternative_logging>> section further for an alternative way of configuring the logging.\n\n[[available-dsn]]\n==== 3. DSN is available\nOnce everything is in place, pressing the _Save_ button will store the configuration into the chosen destination (Registry or file).\n\nBefore saving a DSN configuration the provided file/directory paths are verified to be valid on the current system. The DSN editor\nwill however not verify in any way the validity or reachability of the configured _Hostname_ : _Port_. See <<connection_testing>>\nfor an exhaustive check.\n\nIf everything is correct, the name of the newly created DSN will be listed as available to use:\n\n[[system_added]]\n.Connection added\nimage:images/sql/odbc/administrator_system_added.png[]\n\n[[alternative_logging]]\n==== Alternative logging configuration\n\nDue to the specification of the ODBC API, the driver will receive the configured DSN parameters - including the logging ones - only once a\nconnection API is invoked (such as _SQLConnect_ or _SQLDriverConnect_). The _Driver Manager_ will however always make a set of API calls\ninto the driver before attempting to establish a connection. To capture those calls as well, one needs to pass logging configuration\nparameters in an alternative way. The {odbc} will use an environment variable for this purpose.\n\nConfiguring an environment variable is OS specific and not detailed in this guide. Whether the variable should be configured system-wide\nor user-specific depends on the way the ODBC-enabled application is being run and if logging should affect the current user only or not.\n\nThe definition of the environment variable needs to be done as follows:\n\n* Name: _ESODBC_LOG_DIR_\n\n* Value: [path](?[level]), where:\n+\n[path] is the path to the directory where the log files will be written into;\n+\n[level] is optional and can take one of the following values: _debug_, _info_, _warn_, _error_; if not provided, _debug_ is assumed.\n\n[[env_var_logging]]\n.Logging environment variable\nimage:images/sql/odbc/env_var_log.png[]\n\nNOTE: When enabling the logging through the environment variable, the driver will create *one log file per process*.\n\nBoth ways of configuring the logging can coexist and both can use the same\ndestination logging directory. However, one logging message will only be logged\nonce, the connection logging taking precedence over the environment variable\nlogging.\n"
}