{
    "meta": {
        "timestamp": "2024-11-01T03:07:10.346276",
        "size": 2079,
        "url": "https://www.elastic.co/guide/en/elasticsearch/reference/current/store-smb.html",
        "type": "documentation",
        "role": [],
        "has_code": false,
        "title": "store-smb",
        "version": "8.15"
    },
    "doc": "[[store-smb]]\n=== Store SMB plugin\n\nThe Store SMB plugin works around for a bug in Windows SMB and Java on windows.\n\n:plugin_name: store-smb\ninclude::install_remove.asciidoc[]\n\n[[store-smb-usage]]\n==== Working around a bug in Windows SMB and Java on windows\n\nWhen using a shared file system based on the SMB protocol (like Azure File Service) to store indices, the way Lucene\nopens index segment files is with a write only flag. This is the _correct_ way to open the files, as they will only be\nused for writes and allows different FS implementations to optimize for it. Sadly, in windows with SMB, this disables\nthe cache manager, causing writes to be slow. This has been described in\nhttps://issues.apache.org/jira/browse/LUCENE-6176[LUCENE-6176], but it affects each and every Java program out there!.\nThis need and must be fixed outside of ES and/or Lucene, either in windows or OpenJDK. For now, we are providing an\nexperimental support to open the files with read flag, but this should be considered experimental and the correct way\nto fix it is in OpenJDK or Windows.\n\nThe Store SMB plugin provides two storage types optimized for SMB:\n\n`smb_mmap_fs`::\n\n    a SMB specific implementation of the default\n    {ref}/index-modules-store.html#mmapfs[mmap fs]\n\n`smb_simple_fs`::\n\n    deprecated::[7.15,\"smb_simple_fs is deprecated and will be removed in 8.0. Use smb_nio_fs or other file systems instead.\"]\n\n`smb_nio_fs`::\n\n    a SMB specific implementation of the default\n    {ref}/index-modules-store.html#niofs[nio fs]\n\nTo use one of these specific storage types, you need to install the Store SMB plugin and restart the node.\nThen configure Elasticsearch to set the storage type you want.\n\nThis can be configured for all indices by adding this to the `elasticsearch.yml` file:\n\n[source,yaml]\n----\nindex.store.type: smb_nio_fs\n----\n\nNote that settings will be applied for newly created indices.\n\nIt can also be set on a per-index basis at index creation time:\n\n[source,console]\n----\nPUT my-index-000001\n{\n   \"settings\": {\n       \"index.store.type\": \"smb_mmap_fs\"\n   }\n}\n----\n"
}