{
    "meta": {
        "timestamp": "2024-11-01T02:49:26.599070",
        "size": 2876,
        "url": "https://www.elastic.co/guide/en/elasticsearch/reference/current/synonyms-apis.html",
        "type": "documentation",
        "role": [],
        "has_code": false,
        "title": "synonyms-apis",
        "version": "8.15"
    },
    "doc": "[[synonyms-apis]]\n== Synonyms APIs\n\n++++\n<titleabbrev>Synonyms APIs</titleabbrev>\n++++\n\n---\n\nThe synonyms management API provides a convenient way to define and manage synonyms in an internal system index. Related synonyms can be grouped in a \"synonyms set\".\nCreate as many synonym sets as you need.\n\nThis provides an alternative to:\n\n- Defining inline synonyms in an analyzer definition, which impacts mapping size and can lead to performance issues.\n- Using synonyms files, which implies uploading and managing file consistency on all cluster nodes.\n\nSynonyms sets can be used to configure <<analysis-synonym-graph-tokenfilter,synonym graph token filters>> and <<analysis-synonym-tokenfilter,synonym token filters>>.\nThese filters are applied as part of the <<analysis,analysis>> process by the <<search-analyzer,search analyzer>>.\n\nNOTE: Synonyms sets are limited to a maximum of 10,000 synonym rules per set.\nIf you need to manage more synonym rules, you can create multiple synonyms sets.\n\nWARNING: Synonyms sets must exist before they can be added to indices.\nIf an index is created referencing a nonexistent synonyms set, the index will remain in a partially created and inoperable state.\nThe only way to recover from this scenario is to ensure the synonyms set exists then either delete and re-create the index, or close and re-open the index.\n\n[WARNING]\n====\nInvalid synonym rules can cause errors when applying analyzer changes.\nFor reloadable analyzers, this prevents reloading and applying changes.\nYou must correct errors in the synonym rules and reload the analyzer.\n\nAn index with invalid synonym rules cannot be reopened, making it inoperable when:\n\n* A node containing the index starts\n* The index is opened from a closed state\n* A node restart occurs (which reopens the node assigned shards)\n====\n\n[discrete]\n[[synonyms-sets-apis]]\n=== Synonyms sets APIs\n\nYou can use these APIs to dynamically update synonyms sets used at search time.\nYour search results will immediately reflect the synonyms set changes.\n\nUse the following APIs to manage synonyms sets:\n\n* <<put-synonyms-set>>\n* <<get-synonyms-set>>\n* <<list-synonyms-sets>>\n* <<delete-synonyms-set>>\n\n[discrete]\n[[synonym-rules-apis]]\n=== Synonym rules APIs\n\nSynonyms sets are composed of synonym rules.\nEach synonym rule defines a group of words that act as synonyms.\nYou can update individual synonym rules for a specific synonyms set instead of updating the complete synonyms set.\n\nUse the following APIs to manage individual synonym rules in a synonyms set:\n\n* <<put-synonym-rule>>\n* <<get-synonym-rule>>\n* <<delete-synonym-rule>>\n\ninclude::put-synonyms-set.asciidoc[]\ninclude::get-synonyms-set.asciidoc[]\ninclude::list-synonyms-sets.asciidoc[]\ninclude::delete-synonyms-set.asciidoc[]\ninclude::put-synonym-rule.asciidoc[]\ninclude::get-synonym-rule.asciidoc[]\ninclude::delete-synonym-rule.asciidoc[]\n\n"
}