{
    "meta": {
        "timestamp": "2024-11-01T03:07:10.508271",
        "size": 1874,
        "url": "https://www.elastic.co/guide/en/elasticsearch/reference/current/update-lifecycle-policy.html",
        "type": "documentation",
        "role": [
            "xpack"
        ],
        "has_code": false,
        "title": "update-lifecycle-policy",
        "version": "8.15"
    },
    "doc": "[role=\"xpack\"]\n[[update-lifecycle-policy]]\n=== Lifecycle policy updates\n++++\n<titleabbrev>Policy updates</titleabbrev>\n++++\n\nYou can change how the lifecycle of an index or collection of rolling indices is managed\nby modifying the current policy or switching to a different policy.\n\nTo ensure that policy updates don't put an index into a state where it can't\nexit the current phase, the phase definition is cached in the index metadata\nwhen it enters the phase. If changes can be safely applied, {ilm-init} updates\nthe cached phase definition. If they cannot, phase execution continues using\nthe cached definition.\n\nWhen the index advances to the next phase, it uses the phase definition from the updated policy.\n\n[discrete]\n[[ilm-apply-changes]]\n=== How changes are applied\n\nWhen a policy is initially applied to an index, the index gets the latest version of the policy.\nIf you update the policy, the policy version is bumped and {ilm-init} can detect that the index\nis using an earlier version that needs to be updated.\n\nChanges to `min_age` are not propagated to the cached definition.\nChanging a phase's `min_age` does not affect indices that are currently executing that phase.\n\nFor example, if you create a policy that has a hot phase that does not specify a `min_age`,\nindices immediately enter the hot phase when the policy is applied.\nIf you then update the policy to specify a `min_age` of 1 day for the hot phase,\nthat has no effect on indices that are already in the hot phase.\nIndices created _after_ the policy update won't enter the hot phase until they are a day old.\n\n[discrete]\n[[ilm-apply-new-policy]]\n=== How new policies are applied\n\nWhen you apply a different policy to a managed index,\nthe index completes the current phase using the cached definition from the previous policy.\nThe index starts using the new policy when it moves to the next phase.\n"
}